# GetSheetViews Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFImportOptions..::..GetSheetViews Method
DWFImportOptions Class See Also
---
Get sheet views where DWF markups are imported.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ElementId> GetSheetViews()
```

Visual Basic
---
```text
Public Function GetSheetViews As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetSheetViews()
```

# ### Return Value
An array of sheet views
# See Also
DWFImportOptions Class
Autodesk.Revit.DB Namespace